In [2]:
import pandas as pd
import numpy as np

In [41]:
nitesh=pd.read_csv("even.txt")
nitesh

    name          city     age    marks
0  even            goa      22       62
1    sam      karnatka      25       45
2    jay         delhi      45       82

In [50]:
nitesh=pd.read_csv("even.txt",skipfooter=1)
nitesh

C:\Users\ADMIN\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

    name          city     age    marks
0  even            goa      22       62
1    sam      karnatka      25       45

In [54]:
nitesh=pd.read_csv("even.txt")
nitesh

    name          city     age    marks
0  even            goa      22       62
1    sam      karnatka      25       45
2    jay         delhi      45       82

In [55]:
nitesh.head(1)

    name    city     age    marks
0  even      goa      22       62

In [56]:
nitesh.tail(1)

  name       city     age    marks
2  jay      delhi      45       82

In [57]:
nitesh.describe()

             age      marks
count   3.000000   3.000000
mean   30.666667  63.000000
std    12.503333  18.520259
min    22.000000  45.000000
25%    23.500000  53.500000
50%    25.000000  62.000000
75%    35.000000  72.000000
max    45.000000  82.000000

In [60]:
nitesh.columns

Index(['name', '   city', '   age', '  marks'], dtype='object')

In [63]:
nitesh.index

RangeIndex(start=0, stop=3, step=1)

In [64]:
nitesh.loc[1]

name                sam
   city        karnatka
   age               25
  marks              45
Name: 1, dtype: object

In [65]:
nitesh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     3 non-null      object
 1      city  3 non-null      object
 2      age   3 non-null      int64
 3     marks  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

In [68]:
nitesh=pd.read_csv("even.txt",index_col=[3])
nitesh

          name          city     age
  marks
62       even            goa      22
45         sam      karnatka      25
82         jay         delhi      45

In [71]:
nitesh.sum()

name                      even samjay
   city      goa    karnatka    delhi
   age                             92
dtype: object

In [79]:
nitesh.iloc[0:3]

          name          city     age
  marks
62       even            goa      22
45         sam      karnatka      25
82         jay         delhi      45

In [80]:
nitesh

          name          city     age
  marks
62       even            goa      22
45         sam      karnatka      25
82         jay         delhi      45

In [88]:
nitesh.to_csv("even2.csv")
nitesh

          name          city     age
  marks
62       even            goa      22
45         sam      karnatka      25
82         jay         delhi      45